In [1]:
import pandas as pd
import numpy as np

In [2]:
## dataframe, dataseries and operations in pandas and numpy

In [8]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['col1','col2','col3','col4'])

In [9]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [15]:
df.to_csv("dummy.csv")

In [ ]:
# row wise access
df.loc['row1']

# here the type of above row will be series

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int64

In [18]:
# index wise 
df.iloc[0]

col1    0
col2    1
col3    2
col4    3
Name: row1, dtype: int64

In [25]:
# Column wise access
df['col4']

row1     3
row2     7
row3    11
row4    15
row5    19
Name: col4, dtype: int64

In [26]:
# df.iloc[:row index , column index:]
df.iloc[:,:]

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [27]:
# example
df.iloc[0:2,0:3]

      col1  col2  col3
row1     0     1     2
row2     4     5     6

In [28]:
df.value_counts()

col1  col2  col3  col4
0     1     2     3       1
4     5     6     7       1
8     9     10    11      1
12    13    14    15      1
16    17    18    19      1
Name: count, dtype: int64

In [30]:
df['col3'].value_counts()

col3
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64

In [31]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [33]:
df['col4'].unique()

array([ 3,  7, 11, 15, 19])

In [38]:
# to filter or access few columns like more than 1 then put column namesin list
df[['col1','col2']]

      col1  col2
row1     0     1
row2     4     5
row3     8     9
row4    12    13
row5    16    17

In [39]:
df

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [40]:
#condition on df columns
df[df['col4']>10]

      col1  col2  col3  col4
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [42]:
df.corr()

      col1  col2  col3  col4
col1   1.0   1.0   1.0   1.0
col2   1.0   1.0   1.0   1.0
col3   1.0   1.0   1.0   1.0
col4   1.0   1.0   1.0   1.0

In [ ]:
# Whats NumPy: 
# NumPy is a general-purpose array-processing package. it provides a high performance multidimentionalarray object and tools for working with these arrays. 
# It is the fundamental package for scientific computing with python.

In [ ]:
# What is array?
# An array is a data structure that stores values of same data type. In python, this is the main difference between arrays and lists. 
# While python lists can contain values corresponding to different data types, arrays in python can only contain values corresponding to same data type.

In [ ]:
import numpy as np

# if not installed just run the following cmd
# !pip install numpy

In [ ]:
my_list= [1,2,3,4,5,6]

arr = np.array(my_list)